
## Plan Result (parser-graphql-wrapper-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/47964)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 0 to change, 3 to destroy.</code></pre>

* Create
  * local_file.application_ecs_service_appspec_94386B9C
* Delete
  * aws_elasticache_serverless_cache.serverless_redis_elasticache_serverless_356B3FAF
  * aws_security_group.serverless_redis_elasticache_security_group_31FA49DF
* Replace
  * aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4 must be replaced
-/+ resource "aws_ecs_task_definition" "application_ecs_service_ecs-task_461CC9D4" {
      ~ arn                      = "arn:aws:ecs:us-east-1:996905175585:task-definition/ParserGraphQLWrapper-Prod:674" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:996905175585:task-definition/ParserGraphQLWrapper-Prod" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ image                  = "996905175585.dkr.ecr.us-east-1.amazonaws.com/parsergraphqlwrapper-prod-app:e7f853e383f5cd65ac9e5c343be5d568ead5ea47" -> "996905175585.dkr.ecr.us-east-1.amazonaws.com/parsergraphqlwrapper-prod-app:7784f27a0d21ed50dec1addecf4ba39769d885d5"
                    name                   = "app"
                  ~ portMappings           = [
                      ~ {
                          - protocol      = "tcp"
                            # (2 unchanged attributes hidden)
                        },
                    ]
                    # (9 unchanged attributes hidden)
                },
              ~ {
                    name                   = "aws-otel-collector"
                  ~ portMappings           = [
                      ~ {
                          - protocol      = "tcp"
                            # (2 unchanged attributes hidden)
                        },
                      ~ {
                          - protocol      = "tcp"
                            # (2 unchanged attributes hidden)
                        },
                    ]
                    # (10 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "ParserGraphQLWrapper-Prod" -> (known after apply)
      ~ revision                 = 674 -> (known after apply)
        tags                     = {
            "environment" = "Prod"
            "service"     = "ParserGraphQLWrapper"
        }
        # (9 unchanged attributes hidden)
    }

  # aws_elasticache_serverless_cache.serverless_redis_elasticache_serverless_356B3FAF will be destroyed
  # (because aws_elasticache_serverless_cache.serverless_redis_elasticache_serverless_356B3FAF is not in configuration)
  - resource "aws_elasticache_serverless_cache" "serverless_redis_elasticache_serverless_356B3FAF" {
      - arn                      = "arn:aws:elasticache:us-east-1:996905175585:serverlesscache:parsergraphqlwrapper-prod-serverless" -> null
      - create_time              = "2024-02-12T19:14:57Z" -> null
      - daily_snapshot_time      = "03:00" -> null
      - description              = "Redis for ParserGraphQLWrapper-Prod-serverless" -> null
      - endpoint                 = [
          - {
              - address = "parsergraphqlwrapper-prod-serverless-zcx42u.serverless.use1.cache.amazonaws.com"
              - port    = 6379
            },
        ] -> null
      - engine                   = "redis" -> null
      - full_engine_version      = "7.1" -> null
      - id                       = "parsergraphqlwrapper-prod-serverless" -> null
      - major_engine_version     = "7" -> null
      - name                     = "parsergraphqlwrapper-prod-serverless" -> null
      - reader_endpoint          = [
          - {
              - address = "parsergraphqlwrapper-prod-serverless-zcx42u.serverless.use1.cache.amazonaws.com"
              - port    = 6380
            },
        ] -> null
      - security_group_ids       = [
          - "sg-0a2986dba929a6072",
        ] -> null
      - snapshot_retention_limit = 0 -> null
      - status                   = "available" -> null
      - subnet_ids               = [
          - "subnet-610bdb3b",
          - "subnet-b2a036fa",
          - "subnet-cc66bde0",
        ] -> null
      - tags                     = {
          - "environment" = "Prod"
          - "service"     = "ParserGraphQLWrapper"
        } -> null
      - tags_all                 = {
          - "environment" = "Prod"
          - "service"     = "ParserGraphQLWrapper"
        } -> null
    }

  # aws_security_group.serverless_redis_elasticache_security_group_31FA49DF will be destroyed
  # (because aws_security_group.serverless_redis_elasticache_security_group_31FA49DF is not in configuration)
  - resource "aws_security_group" "serverless_redis_elasticache_security_group_31FA49DF" {
      - arn                    = "arn:aws:ec2:us-east-1:996905175585:security-group/sg-0a2986dba929a6072" -> null
      - description            = "Managed by Terraform" -> null
      - egress                 = [] -> null
      - id                     = "sg-0a2986dba929a6072" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "172.16.0.0/16",
                ]
              - description      = ""
              - from_port        = 6379
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 6379
            },
        ] -> null
      - name                   = "ParserGraphQLWrapper-Prod-serverless20240212183603733200000001" -> null
      - name_prefix            = "ParserGraphQLWrapper-Prod-serverless" -> null
      - owner_id               = "996905175585" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "environment" = "Prod"
          - "service"     = "ParserGraphQLWrapper"
        } -> null
      - tags_all               = {
          - "environment" = "Prod"
          - "service"     = "ParserGraphQLWrapper"
        } -> null
      - vpc_id                 = "vpc-867638e3" -> null
    }

  # local_file.application_ecs_service_appspec_94386B9C will be created
  + resource "local_file" "application_ecs_service_appspec_94386B9C" {
      + content              = (known after apply)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "appspec.json"
      + id                   = (known after apply)
    }

Plan: 2 to add, 0 to change, 3 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobID":"0c16dfb1-0f0e-43a1-9c33-e0b4243bed63","JobName":"parser-graphql-wrapper_infrastructure_plan_prod","PRNumber":168,"Program":"tfcmt","SHA1":"7784f27a0d21ed50dec1addecf4ba39769d885d5","Target":"parser-graphql-wrapper-cdk","Vars":{}} -->